app/controllers/students_controller.rb

    def show
        @student = Student.all.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def update
        @student = Student.find(params[:id])
        @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Juan"], ["updated_at", "2020-05-17 04:11:52.203596"], ["id", 1]]